# プロフィール写真の変更

## ユーザーは自身のメールアドレスで登録したアカウントでプロフィール写真を更新することができる
tags: stateful
* ログイン画面を開く
* メールアドレス"update_me_update_profile_photo@example.com"で始める
サイドバーのアカウント情報にプロフィール画像が設定されていない
* 設定のプロフィール設定を開く
TODO:プロフィール写真をクリック
* 画像"setup/images/update_me_update_profile_photo.png"をアップロードする
* トーストメッセージ"Photo updated"が表示されている
* サイドバーのアカウント情報にプロフィール画像""が設定されている
ここに削除も追加
サイドバーのアカウント情報にプロフィール画像が設定されていない

## ユーザーは自身のGoogleで登録したアカウントでプロフィール写真を更新することができる
tags: stateful,unimplemented
ユーザーは自身のGoolgeアカウント（プロフィール写真設定済）で追加したプロフィール写真を削除してもGoogleアカウントのプロフィール写真が表示されない
* ログイン画面を開く
* "googleで始める"ボタンをクリック
これ用のアカウント作成
* Googleアカウント選択画面でメールアドレス"hogehoge@example.com"を選択する
* サイドバーのアカウント情報にプロフィール画像""が設定されている
* 設定のプロフィール設定を開く
TODO:プロフィール写真をクリック
* 画像"setup/images/update_me_update_profile_photo.png"をアップロードする
* トーストメッセージ"Photo updated"が表示されている
* サイドバーのアカウント情報にプロフィール画像""が設定されている
ここに削除も追加
サイドバーのアカウント情報にプロフィール画像が設定されていない
