# ログイン

## 未登録ユーザーは新規作成で途中離脱しても、正しくアカウントを作成することができる
* ログイン画面を開く
* 入力欄"メールアドレス"に"test+999@example.com"と入力する
* "メールアドレスで始める"ボタンをクリック
* ワンタイムコード入力画面が表示されている
* 画面を更新する
* ログイン画面が表示されている
* 入力欄"メールアドレス"に"test+999@example.com"と入力する
* "メールアドレスで始める"ボタンをクリック
* メールアドレス"test+999@example.com"に送信されたワンタイムパスワードを取得
* ワンタイムパスワード確認画面にワンタイムパスワードを入力する
* "送信"ボタンをクリック
* オンボーディングの名前入力画面が表示されている
* 入力欄"名前"に"test name"と入力する
* "送信"ボタンをクリック
* オンボーディングのワークスペース作成画面が表示されている
* 画面を更新する
* 入力欄"ドメイン"に"test-workspace"と入力する
* "送信"ボタンをクリック
* ホーム画面が表示されている
